In [69]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series
import matplotlib.pyplot as plt
%matplotlib inline

In [70]:
#! unzip /home/dsc/Data/us_dot/otp/On_Time_On_Time_Performance_2015_1.zip
!ls

Groups_with_Pandas.ipynb		readme.html
On_Time_On_Time_Performance_2015_1.csv	Review Pandas.ipynb

In [104]:
df = pd.read_csv("On_Time_On_Time_Performance_2015_1.csv")
len(df)

36968

In [72]:
condition = (df["DayofMonth"]==22) & (df["Month"]==1) & (df["Year"]==2015)
df20150122 = df[condition]
df20150122.sample(5)

,Year,Quarter,Month,DayofMonth,DayOfWeek,FlightDate,UniqueCarrier,AirlineID,Carrier,TailNum,...,Div4TailNum,Div5Airport,Div5AirportID,Div5AirportSeqID,Div5WheelsOn,Div5TotalGTime,Div5LongestGTime,Div5WheelsOff,Div5TailNum,Unnamed: 109
17796,2015,1,1,22,4,2015-01-22,AA,19805,AA,N485AA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14942,2015,1,1,22,4,2015-01-22,AA,19805,AA,N3LFAA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1985,2015,1,1,22,4,2015-01-22,AA,19805,AA,N3ABAA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
357,2015,1,1,22,4,2015-01-22,AA,19805,AA,N5ESAA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35666,2015,1,1,22,4,2015-01-22,AA,19805,AA,N5CPAA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [73]:
len(df20150122)

1213

In [74]:
condition = (df["FlightDate"]=='2015-01-22')
df20150122=df[condition]
len(df20150122)

1213

In [75]:
df1 = DataFrame(np.random.randint(0,10,3*5).reshape(3,5))
df1.columns = ["c1","c2","c3","c4","c5"]
df1

   c1  c2  c3  c4  c5
0   7   8   2   2   8
1   4   4   0   4   8
2   2   9   8   1   5

In [76]:
df1["key1"]=['a','a','b']
df1

   c1  c2  c3  c4  c5 key1
0   7   8   2   2   8    a
1   4   4   0   4   8    a
2   2   9   8   1   5    b

In [77]:
df2 = DataFrame(np.random.randint(0,10,3*5).reshape(3,5))
df2.columns = ["c1","c2","c3","c4","c5"]
df2["key1"]=['b','a','b']
df2

   c1  c2  c3  c4  c5 key1
0   6   5   2   3   5    b
1   2   6   5   4   0    a
2   5   4   5   1   0    b

In [78]:
#Vamos a trabajar los merges
pd.merge(df1,df2,on="key1")

   c1_x  c2_x  c3_x  c4_x  c5_x key1  c1_y  c2_y  c3_y  c4_y  c5_y
0     7     8     2     2     8    a     2     6     5     4     0
1     4     4     0     4     8    a     2     6     5     4     0
2     2     9     8     1     5    b     6     5     2     3     5
3     2     9     8     1     5    b     5     4     5     1     0

In [79]:
df2["key1"]=["a","b","c"]
pd.merge(df1,df2,on="key1",how="right") #inner, left, right, outer

   c1_x  c2_x  c3_x  c4_x  c5_x key1  c1_y  c2_y  c3_y  c4_y  c5_y
0     7     8     2     2     8    a     6     5     2     3     5
1     4     4     0     4     8    a     6     5     2     3     5
2     2     9     8     1     5    b     2     6     5     4     0
3   NaN   NaN   NaN   NaN   NaN    c     5     4     5     1     0

In [82]:
df2["key1"]=["b","a","b"]
df2["key2"]=df2["key1"]
df2

   c1  c2  c3  c4  c5 key1 key2
0   6   5   2   3   5    b    b
1   2   6   5   4   0    a    a
2   5   4   5   1   0    b    b

In [84]:
df1

   c1  c2  c3  c4  c5 key1
0   7   8   2   2   8    a
1   4   4   0   4   8    a
2   2   9   8   1   5    b

In [85]:
df2

   c1  c2  c3  c4  c5 key1 key2
0   6   5   2   3   5    b    b
1   2   6   5   4   0    a    a
2   5   4   5   1   0    b    b

In [83]:
pd.merge(df1,df2,left_on="key1",right_on="key2",suffixes=("i","d"))

   c1i  c2i  c3i  c4i  c5i key1i  c1d  c2d  c3d  c4d  c5d key1d key2
0    7    8    2    2    8     a    2    6    5    4    0     a    a
1    4    4    0    4    8     a    2    6    5    4    0     a    a
2    2    9    8    1    5     b    6    5    2    3    5     b    b
3    2    9    8    1    5     b    5    4    5    1    0     b    b

In [87]:
df1["key2"]='e'

In [90]:
pd.concat([df1,df2]) # superpone los dataframes

   c1  c2  c3  c4  c5 key1 key2
0   7   8   2   2   8    a    e
1   4   4   0   4   8    a    e
2   2   9   8   1   5    b    e
0   6   5   2   3   5    b    b
1   2   6   5   4   0    a    a
2   5   4   5   1   0    b    b

In [92]:
pd.concat([df1,df2],ignore_index=True) #regenera el índice.

   c1  c2  c3  c4  c5 key1 key2
0   7   8   2   2   8    a    e
1   4   4   0   4   8    a    e
2   2   9   8   1   5    b    e
3   6   5   2   3   5    b    b
4   2   6   5   4   0    a    a
5   5   4   5   1   0    b    b

In [95]:
pd.merge(df1,df2,left_on="key1",right_on="key2",how="outer")

,c1_x,c2_x,c3_x,c4_x,c5_x,key1_x,key2_x,c1_y,c2_y,c3_y,c4_y,c5_y,key1_y,key2_y
0,7,8,2,2,8,a,e,2,6,5,4,0,a,a
1,4,4,0,4,8,a,e,2,6,5,4,0,a,a
2,2,9,8,1,5,b,e,6,5,2,3,5,b,b
3,2,9,8,1,5,b,e,5,4,5,1,0,b,b

In [96]:
pd.merge(df1,df2,left_on="key1",right_on="key2",how="inner")

,c1_x,c2_x,c3_x,c4_x,c5_x,key1_x,key2_x,c1_y,c2_y,c3_y,c4_y,c5_y,key1_y,key2_y
0,7,8,2,2,8,a,e,2,6,5,4,0,a,a
1,4,4,0,4,8,a,e,2,6,5,4,0,a,a
2,2,9,8,1,5,b,e,6,5,2,3,5,b,b
3,2,9,8,1,5,b,e,5,4,5,1,0,b,b

# GROUP BY

In [100]:
df = pd.read_csv("On_Time_On_Time_Performance_2015_1.csv")
len(df)

36968

In [106]:
minidf = df[df["FlightDate"]=='2015-01-22']

In [107]:
len(minidf)

1213

In [109]:
by_carrier = minidf.groupby("Carrier") # esto es una agrupación del dataframe by carrier.
#Cada fila tiene un carrier, y saldrá una fila por carrier.

In [112]:
by_carrier.get_group("AA").sample(5) # Extrae un dataframe para este carrier en concreto.

,Year,Quarter,Month,DayofMonth,DayOfWeek,FlightDate,UniqueCarrier,AirlineID,Carrier,TailNum,...,Div4TailNum,Div5Airport,Div5AirportID,Div5AirportSeqID,Div5WheelsOn,Div5TotalGTime,Div5LongestGTime,Div5WheelsOff,Div5TailNum,Unnamed: 109
35875,2015,1,1,22,4,2015-01-22,AA,19805,AA,N3KJAA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13694,2015,1,1,22,4,2015-01-22,AA,19805,AA,N548AA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12503,2015,1,1,22,4,2015-01-22,AA,19805,AA,N3ANAA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20700,2015,1,1,22,4,2015-01-22,AA,19805,AA,N566AA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28499,2015,1,1,22,4,2015-01-22,AA,19805,AA,N5EGAA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [143]:
by_carrier.get_group("AA").sum().sample(5)

DestCityMarketID        38119580
Div3AirportID                NaN
DepartureDelayGroups        -295
DepTime                  1598478
Div1TotalGTime               156
dtype: float64

In [145]:
len(by_carrier.get_group("AA"))

1213